export default {
  'index': 'Все новости',
  '2026-01-15-model-update': 'Масштабное обновление моделей',
  '2025-12-26-riverflow': 'Модели Riverflow',
  '2025-12-21-newyear': 'Новогодняя акция',
  '2025-10-13-update-7-5': 'Обновление 7.5',
  '2025-07-07-update-7-0': 'Обновление 7.0',
  '2025-05-09-update-6-3': 'Обновление 6.3',
  '2025-04-19-ml-provider': 'Провайдер ML+',
  '2025-03-23-update-6-1': 'Обновление 6.1',
  '2025-02-21-update-6-0': 'Обновление 6.0',
  '2025-01-16-update-5-5': 'Обновление 5.5',
  '2024-11-28-update-5-2': 'Обновление 5.2',
  '2024-11-05-update-5-0': 'Обновление 5.0',
  '2024-09-26-update-4-5': 'Обновление 4.5'
}
