[{"title":"Image Editor","href":"/en/docs/editor","content":"Image Editor The ArtGeneration.me image editor is a powerful tool for refining and enhancing generated images. It combines classic editing tools with artificial intelligence capabilities. !Image Editor Interface Editor Sections The editor consists of several main sections: Settings Section Basic image transformation tools: - Crop — select the desired area to crop the image - Horizontal Flip — mirror reflection from left to right - Vertical Flip — mirror reflection from top to bottom Filters Sect","section":"editor"},{"title":"Image Editor","href":"/en/docs/editor","content":"Image Editor The editor allows you to modify generated images without the need for third-party programs. It's a powerful tool for finalizing your generations. !ArtGeneration.me Image Editor How to Open the Editor There are several ways to open an image in the editor: From the generator gallery Hover over an image and click the \"To Editor\" button. From the main gallery Open an image and select \"Edit\". Directly Go to the \"Editor\" section in the navigation and upload an image. Main Tools Crop Crop ","section":"docs"},{"title":"Frequently Asked Questions (FAQ)","href":"/en/docs/faq","content":"Frequently Asked Questions (FAQ) How do I upload my own image for generation? Use the \"Your Image\" function in the right panel of generation settings. You can upload an image from your device and use it as a basis for further generation. Please note that according to the service rules, you can only upload images that you have rights to. Do not use other people's images found on the Internet. What is the difference between PRO subscription and free access? PRO subscription opens a number of addit","section":"docs"},{"title":"Gallery Categories","href":"/en/docs/gallery/categories","content":"Gallery Categories !Gallery Categories The ArtGeneration.me gallery is organized by categories for easy navigation and finding inspiration. Categories help quickly find images of a specific theme. Main Categories All — the complete collection of public images without filtering. Here you'll find all the variety of user works. New — recently uploaded works. A great way to follow fresh content and new trends. Popular — images with the most likes. The best works selected by the community. Top — best","section":"gallery"},{"title":"Cover Interaction","href":"/en/docs/gallery/cover-interaction","content":"Cover Interaction !Cover Interaction Each image in the gallery is presented as a card with a cover. Various actions and information are available when interacting with the card. Image Card Elements Image preview - a reduced version of the work, optimized for fast loading. The preview maintains the original proportions. Author information - at the bottom of the card, the avatar and name of the user who created the image are displayed. Like counter - shows the number of users who liked this work. ","section":"gallery"},{"title":"Create Your Version","href":"/en/docs/gallery/create-version","content":"Create Your Version !Create Your Version The \"Create your version\" feature is a powerful tool for learning and creativity. It allows you to use a liked image as a starting point for your own experiments. How to Use the Feature 1. Find an interesting image - browse the gallery and find a work that inspires you. 2. Open the view - click on the image to go to detailed view. 3. Click \"Create your version\" - the button is located in the action panel next to the image. 4. Go to the generator - you wil","section":"gallery"},{"title":"Gallery View","href":"/en/docs/gallery/gallery-view","content":"Gallery View !Gallery View The ArtGeneration.me gallery showcases user-created images in an interactive grid optimized for convenient viewing on any device. Image Count Slider At the top of the gallery, there is a slider for adjusting the number of displayed images. This allows you to customize the grid density to your preferences: - More images — compact overview of many works - Fewer images — larger previews for detailed examination Interactive Cards !Gallery Cards Each image is presented as a","section":"gallery"},{"title":"Generation Details","href":"/en/docs/gallery/generation-details","content":"Generation Details !Generation Details The image viewing page displays all parameters used during generation. This information helps understand how the image was created and use this knowledge for your own works. Prompt The main text prompt that describes the desired image. The prompt is the \"instruction\" for the neural network. What you can learn from the prompt: - What keywords the author used - How the prompt is structured - What details were explicitly specified Copying the prompt - click th","section":"gallery"},{"title":"Image View","href":"/en/docs/gallery/image-view","content":"Image View !Image View When clicking on an image in the gallery, full-screen viewing mode opens. Here you can study the work in detail, learn the generation parameters, and interact with the image. Viewing Interface The image viewing page consists of several main areas: Image area - the central part of the screen with the high-resolution image. The image is scaled for optimal display on your screen. Information panel - on the right or bottom (depending on device) is a panel with detailed informa","section":"gallery"},{"title":"Main Gallery","href":"/en/docs/gallery","content":"Main Gallery !Main Gallery ArtGeneration.me The gallery showcases user-created images in an interactive grid. Here you can find inspiration, study techniques of other artists, and discover new styles. Image Count Slider At the top of the gallery, there is a slider that allows you to adjust the number of displayed images on the page. Move the slider to increase or decrease the number of visible works. Categories and Filters !Category Filter The gallery supports filtering by categories for conveni","section":"gallery"},{"title":"Interactive Elements","href":"/en/docs/gallery/interactive-elements","content":"Interactive Elements !Interactive Elements The gallery contains many interactive elements for interacting with content. Action Buttons - Like - mark an image as liked - Favorites - add to favorites collection - Share - send a link to the image - Download - download the image to your device Social Features - Subscribe to author - follow a user's new works - Comments - leave feedback under an image - Repost - share on social networks Context Menu Right-clicking on an image opens additional options","section":"gallery"},{"title":"Search and Categories","href":"/en/docs/gallery/search-categories","content":"Search and Categories !Search and Categories The ArtGeneration.me gallery provides powerful tools for searching and filtering images. You can easily find inspiration, explore other users' work, or find specific styles and techniques. Search Bar At the top of the gallery is a search bar that allows you to search for images by various criteria: By keywords - enter a description of what you want to find. Search works on prompts, tags, and image descriptions. By author name - enter a username to fin","section":"gallery"},{"title":"Similar Images","href":"/en/docs/gallery/similar-images","content":"Similar Images !Similar Images Below the viewed image is a section with similar works. This feature helps find inspiration and explore different approaches to similar themes. How Similar Image Selection Works The ArtGeneration.me system uses several criteria to select relevant works: Visual similarity - algorithms analyze image content: colors, composition, objects. This allows finding visually similar works regardless of the prompts used. Semantic similarity - analysis of prompts and descriptio","section":"gallery"},{"title":"View Elements","href":"/en/docs/gallery/view-elements","content":"View Elements !View Elements The image viewing page contains many informative elements. Top Panel - Work title - if specified by the author - Creation date - when the image was generated - Close button - return to gallery Side Panel - Author avatar - profile photo - Author name - link to profile - Subscribe button - subscribe to author - Statistics - likes, views, comments Bottom Panel - Action buttons - like, favorites, download, share - \"Create version\" button - use as a basis for your own gen","section":"gallery"},{"title":"Main Gallery","href":"/en/docs/gallery","content":"Main Gallery The Gallery is the heart of the platform where you can view works by other users, find inspiration, and interact with the community. This is where all public generations are displayed. Viewing Images When you open the gallery, you'll see a grid of images generated by platform users. Each image card shows: - The image itself - Author's avatar and name - Number of likes - Generation date Full Image View Click on any image to open it in full view. In this mode you can: - See the image ","section":"docs"},{"title":"Copy Link","href":"/en/docs/generator/additional-actions/copy-link","content":"Copy Link !Copy Link The copy link function allows you to get a direct URL to the image for quick sharing. How to Use Hover over the image Find the desired image in the generation results. Click the \"Copy Link\" button The button will appear on the action toolbar. Done The link is copied to clipboard. Link Features The copied link supports automatic preview in social networks and messengers. When pasting the link, the recipient will immediately see an image preview. Applications - Share the image","section":"additional-actions"},{"title":"Create Similar","href":"/en/docs/generator/additional-actions/create-similar","content":"Create Similar !Create Similar The \"Create Similar\" function generates variations of an image with the same parameters but a different seed. How It Works When clicking the \"Create Similar\" button: Copying Parameters All parameters of the original generation are copied. Generating New Seed A new random seed is created. Starting Generation A new generation is automatically started. Result You will get an image: - With the same prompt - With the same model and style - With the same technical parame","section":"additional-actions"},{"title":"Download","href":"/en/docs/generator/additional-actions/download","content":"Download !Download The download function allows you to save an image to your device in various formats. Image Storage All images are stored on the server in WebP format without quality loss. When downloading, you can choose any format without degrading the original quality. Available Formats When downloading, you can choose the format: WebP — modern format with excellent compression. Recommended for publishing on the web. Native storage format. PNG — high quality without loss. Ideal for further ","section":"additional-actions"},{"title":"Face Restoration","href":"/en/docs/generator/additional-actions/face-restoration","content":"Face Restoration !Face Restoration The face restoration function repairs distorted faces in generated images. Purpose Face restoration is intended for significantly damaged faces, not for minor adjustments. Use this function when a face is severely distorted. Problem AI generation sometimes creates faces with: - Severe feature distortions - Blurry or unclear details - Asymmetry - Noticeable artifacts Solution Face restoration uses specialized algorithms to: - Repair distorted facial features - I","section":"additional-actions"},{"title":"Fullscreen Mode","href":"/en/docs/generator/additional-actions/fullscreen","content":"Fullscreen Mode !Fullscreen Mode Fullscreen mode allows you to view an image at maximum size with zoom and pan capabilities. How to Activate Hover over the image Select the desired image. Click the fullscreen button Or double-click the image. Done The image will open in fullscreen. Features In fullscreen mode you can access: - Maximum resolution viewing - Zoom — zoom in and out - Pan — move across the zoomed image - Navigate between images Controls - Arrows — go to next/previous image - +/- or m","section":"additional-actions"},{"title":"Additional Actions","href":"/en/docs/generator/additional-actions","content":"Additional Actions After generating an image, a number of additional actions are available for improving and working with the result. Available Actions When hovering over a generated image, an action button panel appears: - Own Image — use as a base for new generation - Create Similar — generate a variation - Upscale 2x — improve resolution - Face Restoration — improve face quality - Restoration + Upscale — restore faces and upscale 2x in one click - Outpainting — add content beyond image bounda","section":"additional-actions"},{"title":"Outpainting","href":"/en/docs/generator/additional-actions/outpainting","content":"Outpainting !Outpainting Outpainting allows you to expand an image beyond its current boundaries, adding new content in chosen directions. How It Works The AI analyzes the existing image and generates a continuation: - Preserves style and atmosphere - Continues the composition - Adds logical elements Extension Directions You can expand the image in any direction: - Extend top — add content above the image - Extend left — expand to the left - Extend right — expand to the right - Extend bottom — a","section":"additional-actions"},{"title":"Your Image","href":"/en/docs/generator/additional-actions/own-image","content":"Your Image !Your Image The \"Your Image\" function allows you to use a generated or uploaded image as a basis for a new generation (img2img). How to Use Hover over the image Select an image in the generation results. Click the \"Your Image\" button The image will be added to the settings panel. Adjust the influence strength Set the degree of influence from the source image. Enter a prompt Add a new prompt or modify the existing one. Start generation Click the \"Create\" button. Influence Strength The ","section":"additional-actions"},{"title":"Restoration + Upscale","href":"/en/docs/generator/additional-actions/restoration-upscale","content":"Restoration + Upscale !Restoration + Upscale A combined function that merges face restoration and resolution upscaling into a single action. Advantages With a single click, two operations are performed: 1. Face restoration 2. 2x resolution upscaling This saves time and simplifies the process of enhancing portrait images. How to Use Hover over the image Select an image with faces that needs enhancement. Click the \"Restoration + Upscale\" button Launch both operations with a single click. Wait for ","section":"additional-actions"},{"title":"Upscale 2x","href":"/en/docs/generator/additional-actions/upscale-2x","content":"Upscale 2x !Upscale 2x The upscale function doubles the image size while preserving quality. How It Works Upscale uses special AI algorithms for: - Increasing image size by 2 times - Adding details - Preserving sharpness - Eliminating scaling artifacts How to Use Hover over the image Select the image you want to upscale. Click the \"Upscale 2x\" button The button will appear on the action toolbar. Wait for processing The result will open in a popup window. Download the result The upscaled image mu","section":"additional-actions"},{"title":"Image Generator","href":"/en/docs/generator","content":"Image Generator !ArtGeneration.me Image Generator The Image Generator is the main tool of ArtGeneration.me, allowing you to create unique images using artificial intelligence. Here you can bring any creative ideas to visual form. Generator Interface The interface is divided into three main areas: 1. Central area — generation results and prompt input field 2. Left panel — generation history and quick actions 3. Right panel — model settings, styles, and parameters !Right panel Prompt Input Field !","section":"generator"},{"title":"Favorites","href":"/en/docs/generator/left-panel/favorites","content":"Favorites The favorites section allows you to save liked images for quick access. Favorites Counter Each image in the left panel displays a counter showing how many users have added it to favorites. Adding to Favorites To add an image to favorites, use the corresponding icon when viewing the image. Working with Favorites When working with images in favorites, standard actions are available: - Deletion — delete the image - Preview — hover over the magnifying glass icon for a quick preview - Fulls","section":"left-panel"},{"title":"Folders","href":"/en/docs/generator/left-panel/folders","content":"Folders Folders allow you to organize your images for convenient access. Image Organization Use folders to group images by projects, themes, or any other criteria. Working with Images in Folders When working with images in folders, standard actions are available: - Deletion — delete the image - Preview — hover over the magnifying glass icon for a quick preview - Fullscreen Mode — open the image in fullscreen - Privacy Settings — eye icon for managing visibility Search Use prompt text search to f","section":"left-panel"},{"title":"Generation History","href":"/en/docs/generator/left-panel/history","content":"Generation History Generation history is the section where all your created images are displayed. Image Display All your images are displayed in chronological order — from newest to oldest. Search Use the search function to find images by prompt text. Simply enter keywords, and the system will show matching generations. Mobile Version On mobile devices and small screens, the history section is hidden by default. Click on the panel to expand it. Image Actions When working with images, the followi","section":"left-panel"},{"title":"Left Panel","href":"/en/docs/generator/left-panel","content":"Left Panel The generator's left panel displays all your created images and provides tools for working with them. Main Features Chronological Order — all your created images are displayed in chronological order. Search by Prompt — the search function allows you to find images by prompt text. Likes and Favorites Counters — each image displays the number of likes and favorites. Reset Button (green) At the top of the left panel, there is a green reset button. It allows you to quickly reset all curre","section":"left-panel"},{"title":"Quick Actions","href":"/en/docs/generator/left-panel/quick-actions","content":"Quick Actions !Quick Actions Quick actions are a set of frequently used functions available with one click. They speed up workflow and allow you to perform typical operations without navigating through menus. Location The quick actions panel is located at the bottom of the generator's left panel. It's always visible and accessible regardless of the selected tab (History, Favorites, Folders). Main Actions Generate — starts generation with current parameters. This is the main button for creating i","section":"left-panel"},{"title":"Prompt Writing","href":"/en/docs/generator/query-language","content":"Prompt Writing A prompt is a text description of the image you want to create. The quality of your prompt directly affects the generation result. Recommended Prompt Structure For best results, follow this structure: Image Type Photograph, illustration, 3D render, painting. Subject What is depicted: person, animal, landscape, object. Appearance Object details: color, size, material, texture. Scene Elements Additional objects and environmental details. Location Where the action takes place: studio","section":"generator"},{"title":"Prompt Tips","href":"/en/docs/generator/query-tips","content":"Prompt Tips Practical recommendations for writing effective prompts. Follow the Structure Recommended prompt structure for best results: Image Type Photograph, drawing, 3D, illustration Subject What or who is in the image Appearance Details and characteristics of the subject Elements Additional objects and details Location Where the subject is located Effects Lighting, atmosphere, mood Style Artistic direction Be Specific The more detailed the description, the more accurate the result: Use Weigh","section":"generator"},{"title":"Face Swap","href":"/en/docs/generator/right-panel/face-swap","content":"Face Swap !Face Swap ArtGeneration.me offers a face replacement feature for images. This tool allows you to replace a face in any generation or uploaded image with another face of your choice. Face swap can be activated in several situations. When creating a new generation In the right sidebar, find the \"Face Swap\" section and upload a photo with the face you want to use. After the image is generated, the system will automatically apply the replacement, and both the result with face swap and wit","section":"right-panel"},{"title":"Right Panel","href":"/en/docs/generator/right-panel","content":"Right Panel The right panel of the generator is the control center for all image generation parameters in ArtGeneration.me. Here you select the model, style, configure technical parameters, and use additional features. Panel Structure The right panel is organized into logical sections, each responsible for a specific aspect of generation: Model and Style Selection — the foundation of any generation. The model determines the \"character\" of the image, while the style adds an artistic direction. Pr","section":"right-panel"},{"title":"Custom Image (img2img)","href":"/en/docs/generator/right-panel/init-image","content":"Custom Image (img2img) !Custom Image \"Custom Image\" allows you to use any image as a basis for generation. You can upload an existing image, draw a sketch, or use a mask for partial regeneration. !Editing example - putting a hat on a cat All generations from \"Custom Image\" are set to \"Private Mode\" by default, so you don't accidentally share something you didn't intend to. Ways to Add an Image Upload Image Upload an existing image from your device: - Formats: webp, jpg, png - Maximum size: 5 MB ","section":"right-panel"},{"title":"LoRA","href":"/en/docs/generator/right-panel/loras","content":"LoRA !LoRA LoRA (Low-Rank Adaptation) are additional mini-models that add new information to generation. Each LoRA is trained on a single specific concept, allowing precise reproduction of certain styles, characters, or effects. What is LoRA LoRA are small fine-tuned models that add new knowledge to the base model. The following LoRA categories are available in ArtGeneration.me: - Gestures and poses - specific poses, hand gestures, camera angles - Characters - specific characters from games, mov","section":"right-panel"},{"title":"Models","href":"/en/docs/generator/right-panel/models","content":"Models !Model selection A model is like an operating system. If ArtGeneration.me is a computer, then the model is its operating system. Everything you can generate depends on the model. Base Architectures The platform uses two main architectures: - SDXL — a high-quality architecture for creating detailed images - FLUX — the newest architecture with deep prompt understanding and improved instruction following Based on these base architectures, the community around the world trains their own speci","section":"right-panel"},{"title":"Negative Prompt","href":"/en/docs/generator/right-panel/negative-prompt","content":"Negative Prompt !Negative Prompt The negative prompt is a tool that tells the AI what to avoid when generating an image. It is entered in the \"Avoid\" field on the settings panel. How Negative Prompt Works When you specify something in the \"Avoid\" field, the model tries to \"move away\" from these concepts during generation. This doesn't guarantee the element won't appear, but significantly reduces the probability. Negative prompt is especially useful for: - Eliminating typical AI artifacts - Exclu","section":"right-panel"},{"title":"Generation Parameters","href":"/en/docs/generator/right-panel/parameters","content":"Generation Parameters !Generation Parameters Technical parameters allow you to fine-tune the image generation process. Understanding these parameters will help you get higher quality and more predictable results. Seed !Seed Seed is the initial value for the random number generator. This number determines the \"randomness\" of generation. How it works: - With the same seed value and all other parameters, you will get an identical image - A random seed gives a unique result each time - You can copy ","section":"right-panel"},{"title":"Performance Mode","href":"/en/docs/generator/right-panel/performance-mode","content":"Performance Mode !Performance Mode Performance mode (creativity) is a convenient way to quickly configure the balance between generation speed and result quality. Instead of manually adjusting multiple parameters, you can choose one of the preset modes. Available Modes Sketch The fastest mode for testing ideas. Characteristics: - Minimum number of generation steps - Fastest execution time - Basic image quality - Minimum generation usage When to use: - Quick prompt idea testing - Finding the righ","section":"right-panel"},{"title":"Resolution","href":"/en/docs/generator/right-panel/resolution","content":"Resolution !Resolution Resolution determines the size of the generated image in pixels. Choosing the right resolution is important for obtaining a quality result. How to choose resolution In ArtGeneration.me, a convenient slider is available for selecting resolution. You can: - Choose from preset aspect ratios (1:1, 3:4, 4:3, 16:9, 9:16) - Manually set width and height using sliders - See the current aspect ratio and size in pixels Aspect ratios Square (1:1) Ideal for: - Portraits - Avatars and ","section":"right-panel"},{"title":"Styles","href":"/en/docs/generator/right-panel/styles","content":"Styles !Styles ArtGeneration.me features an extensive collection of 307 unique styles gathered from around the world. Each style has its own characteristics and can dramatically change the generation result. Styles are preset requests that are added to what you enter in the main text input. Styles are a convenient and quick way to try different concepts. !Style Selection The same prompt will work completely differently with different styles. Style Categories Styles are grouped into categories fo","section":"right-panel"},{"title":"Image Generator","href":"/en/docs/generator","content":"Image Generator The Generator is the main tool of the platform for creating images using artificial intelligence. Here you can bring your ideas to life using text descriptions. Prompts A prompt is a text description of the image you want to create. The quality of your prompt directly affects the result. Writing Effective Prompts Write prompts in English for best results. Most AI models are trained primarily on English data. A good prompt includes: 1. Main Subject — what or who is depicted (a wom","section":"docs"},{"title":"User Guide","href":"/en/docs","content":"ArtGeneration.me User Guide Welcome to the ArtGeneration.me user guide — a platform for creating images using artificial intelligence. About the Platform ArtGeneration.me provides access to advanced image generation models. You can create unique images using text descriptions (prompts), choose different styles and models, and apply advanced editing features. Getting Started 1. Register on the platform via social networks or email 2. Explore the gallery for inspiration and understanding of capabi","section":"docs"},{"title":"Generation Counter","href":"/en/docs/main-page/generation-counter","content":"Generation Counter !Generation Counter The generation counter displays the number of available generations and helps track your balance. The counter is always visible at the top of the screen, allowing you to quickly check your remaining generations. Location The counter is located at the top of the interface and is always available for viewing. Counter Information - Current balance — number of available generations - Generation type — daily or non-expiring - Subscription status — whether PRO su","section":"main-page"},{"title":"Getting Generations","href":"/en/docs/main-page/getting-generations","content":"Getting Generations !Getting Generations Generations are the main currency on the ArtGeneration.me platform. Each generation allows you to create one image using artificial intelligence. Ways to Get Generations Free Generations - Daily generations — every day you receive a certain number of free generations - Welcome bonus — new users receive 100 non-expiring generations upon registration The welcome bonus of 100 generations is a great way to explore the service's features without any costs! Pai","section":"main-page"},{"title":"ArtGeneration.me Main Page","href":"/en/docs/main-page","content":"ArtGeneration.me Main Page Navigation Bar At the very top of the screen, you will see the navigation bar wherever you are. You can return to the main page at any time by clicking on the ArtGeneration.me logo. The navigation menu has three main sections: - Explore — This is the main section from which you can navigate to any other. Here you will find the main gallery with search and categories, as well as the image gallery. - Create — In the \"Create\" section, you can generate your own image. We w","section":"main-page"},{"title":"Navigation","href":"/en/docs/main-page/navigation","content":"Navigation !Navigation Navigation elements help you move around the site. Top Menu The top menu contains: - Logo (link to main page) - Main sections - User menu - Language selection Main Sections - Generator — image creation - Gallery — view works - Pricing — tariffs and subscriptions Quick Access Use keyboard shortcuts for quick navigation between sections.","section":"main-page"},{"title":"Payment Window","href":"/en/docs/main-page/payment-window","content":"Payment Window The payment window allows you to purchase PRO access or additional generations. Accessing the Payment Window The payment window can be opened in several ways: Through the Header Button Click on the \"Claim 600\" button at the top of the site. Through the Coin Counter Click on the coin counter in the upper right corner. Through the User Menu Go to the \"Payments\" section in the user dropdown menu. Payment Window Tabs The payment window contains three tabs: 1. One-time Payment PRO acce","section":"main-page"},{"title":"Main Page","href":"/en/docs/main-page","content":"Main Page The ArtGeneration.me main page is your starting point for working with the platform. Interface Elements Navigation Bar At the top of the page is a navigation bar with main sections: - Gallery — view user works - Create — go to the image generator - Editor — editing tools - About — platform information - Guide — documentation (you are here) Quick Access On the main page you will find: - Examples of generated images - Quick access to the generator - Information about platform capabilitie","section":"docs"},{"title":"Welcome & Registration","href":"/en/docs/registration","content":"Welcome & Registration Welcome to the amazing world of digital creativity at ArtGeneration.me, where anyone can become an artist with the help of artificial intelligence. To begin your journey, you need to create a personal account. This will allow you to fully immerse yourself in the creative process and use all the platform's tools. On the main page, you'll find the \"Start Creating\" button - your first step towards creating unique images. When viewing any image in the gallery, you can also sta","section":"registration"},{"title":"Registration Process","href":"/en/docs/registration/process","content":"Registration Process !Registration Process Registration on ArtGeneration.me is a quick and simple process that takes less than a minute. The platform offers several ways to create an account at your choice. Registration Methods Quick Login via VK The fastest way for VKontakte users: 1. Click the \"Sign in with VK\" button 2. Confirm access in the VKontakte window 3. Done — your account is created automatically Advantages: - No need to create a new password - Automatic profile filling (name, avatar","section":"registration"},{"title":"Welcome Bonus","href":"/en/docs/registration/welcome-bonus","content":"Welcome Bonus !Welcome Bonus Every new ArtGeneration.me user receives a generous welcome bonus that allows you to immediately try all platform features without restrictions. What's Included in the Bonus 3 Days of PRO Subscription Full access to all premium platform features for 3 days: Increased Limits: - 300 generations per day instead of the standard 50 - Ability to generate images in high resolution - Priority queue — your generations are processed faster Extended Access: - All generation mod","section":"registration"},{"title":"Why Register?","href":"/en/docs/registration/why-register","content":"Why Register? !Why Register Registration on ArtGeneration.me opens access to the full functionality of the platform and many benefits unavailable to guest users. Saving Your Work Generation History: - All your generations are automatically saved in the cloud - Access your history from any device - Ability to return to any work and create a new version - View generation parameters to replicate results Collection Organization: - Add your best works to favorites - Create folders for thematic organi","section":"registration"},{"title":"Registration","href":"/en/docs/registration","content":"Registration on ArtGeneration.me To use all the features of the platform, you need to register. Registration Methods Via Social Networks The fastest way is authorization via social networks: - VKontakte — for users from Russia - Yandex — for users from Russia Via Email You can also register using your email address. Registration Process Step 1 Go to the main page and click the \"Login\" button Step 2 Choose the authorization method: social network or email Step 3 Confirm access to your account (fo","section":"docs"},{"title":"Service Rules","href":"/en/docs/rules","content":"Service Rules 1. The service is intended for persons over 18 years of age. By registering, you confirm your adulthood. 2. It is prohibited to use the service to create images that violate the legislation of the Russian Federation: containing pornography, scenes of violence, propaganda of extremism, incitement of ethnic hatred, etc. Moderators will delete such content without warning. 3. In the NSFW section, light erotic content is allowed without explicit scenes, genitalia, and imitation of sexu","section":"docs"},{"title":"User Menu","href":"/en/docs/user-menu","content":"User Menu !User Menu The user menu is the control center for your account on ArtGeneration.me. Here you'll find all settings, balance information, subscriptions, and tools for working with your images. How to Open the Menu The user menu is accessible from any page on the site: Find the profile icon The profile icon is located in the upper right corner of the site header. Open the menu Click on the icon to open the dropdown menu. Select a section Choose the desired section from the list. If you a","section":"user-menu"},{"title":"User Menu","href":"/en/docs/user-menu","content":"User Menu The user menu provides access to account settings and personal features. To open the menu, click on the profile icon in the upper right corner of the screen. Personal The \"Personal\" section is your personal cabinet on the platform. My Works All your generated images are stored here. You can: - View generation history - Organize images into folders - Delete unwanted works - Make images public or private Folders Create folders to organize your works by projects or themes: 1. Click \"Creat","section":"docs"},{"title":"How to Edit Documentation","href":"/en/about-docs/contributing","content":"How to Edit Documentation Anyone can help improve ArtGeneration.me documentation! It's easier than you think. Here you'll find step-by-step instructions for beginners. Why Contribute? - You noticed an error or typo - Description is outdated after a service update - You want to add useful information - You can explain a feature better Your contribution will help thousands of other users! Method 1: Browser Editing (Easiest) This method requires no software installation. Everything is done in your ","section":"about-docs"},{"title":"Documentation Contributors","href":"/en/about-docs/contributors","content":"Documentation Contributors This documentation is created and maintained by the ArtGeneration.me community. We thank everyone who helps improve the materials! How to Get Listed If you've contributed to the documentation (fixed an error, added a new section, improved descriptions), you can add yourself to the contributors list. Simply edit this page and add your information using the template below. Our Contributors ArtGeneration.me Team The core team of developers and service creators. - ArtGener","section":"about-docs"},{"title":"News and Updates","href":"/en/news","content":"News and Updates Follow the development of the ArtGeneration.me platform. Here are all service updates. --- Update 7.5 Date: October 13, 2025 !New Models 1. New AI Models Added many of the most current models. From Juggernaut Base Flux and HiDream-i1 to the latest image editing models Seedream 4.0 and FLUX.1 Kontext [dev]. Pay attention to generation costs and model operation modes. !Background Image Rating 2. Background Image Rating Added background image rating functionality. Leave a rating if","section":"news"}]