[{"title":"Редактор изображений","href":"/ru/docs/editor","content":"Редактор изображений Редактор изображений ArtGeneration.me — это мощный инструмент для доработки и улучшения сгенерированных изображений. Он сочетает классические инструменты редактирования с возможностями искусственного интеллекта. !Интерфейс редактора изображений Разделы редактора Редактор состоит из нескольких основных разделов: Раздел «Настройка» Базовые инструменты трансформации изображения: - Обрезка — выделите нужную область для кадрирования изображения - Отражение по горизонтали — зеркал","section":"editor"},{"title":"Редактор изображений","href":"/ru/docs/editor","content":"Редактор изображений Редактор позволяет модифицировать сгенерированные изображения без необходимости использования сторонних программ. Это мощный инструмент для финальной обработки ваших генераций. !Редактор изображений ArtGeneration.me Как открыть редактор Есть несколько способов открыть изображение в редакторе: Из галереи генератора Наведите на изображение и нажмите кнопку \"В редактор\". Из основной галереи Откройте изображение и выберите \"Редактировать\". Напрямую Перейдите в раздел \"Редактор\" ","section":"docs"},{"title":"Часто задаваемые вопросы (FAQ)","href":"/ru/docs/faq","content":"Часто задаваемые вопросы (FAQ) Как загрузить в сервис своё изображение для генерации? Воспользуйтесь функцией \"Свое изображение\" в правой панели настроек генерации. Вы сможете загрузить изображение со своего устройства и использовать его как основу для дальнейшей генерации. Обратите внимание, что согласно правилам сервиса вы можете загружать только те изображения, на которые у вас есть права. Не используйте чужие изображения, найденные в Интернете. Чем отличается подписка PRO от бесплатного дост","section":"docs"},{"title":"Категории галереи","href":"/ru/docs/gallery/categories","content":"Категории галереи !Категории галереи Галерея ArtGeneration.me организована по категориям для удобной навигации и поиска вдохновения. Категории помогают быстро найти изображения определённой тематики. Основные категории Все (All) — полная коллекция публичных изображений без фильтрации. Здесь вы найдёте всё разнообразие работ пользователей. Новые (New) — последние загруженные работы. Отличный способ следить за свежим контентом и новыми трендами. Популярные (Popular) — изображения с наибольшим коли","section":"gallery"},{"title":"Взаимодействие с обложкой","href":"/ru/docs/gallery/cover-interaction","content":"Взаимодействие с обложкой !Взаимодействие с обложкой Каждое изображение в галерее представлено в виде карточки с обложкой. При взаимодействии с карточкой доступны различные действия и информация. Элементы карточки изображения Превью изображения — уменьшенная версия работы, оптимизированная для быстрой загрузки. Превью сохраняет пропорции оригинала. Информация об авторе — в нижней части карточки отображается аватар и имя пользователя, создавшего изображение. Счётчик лайков — показывает количество","section":"gallery"},{"title":"Создать свою версию","href":"/ru/docs/gallery/create-version","content":"Создать свою версию !Создать свою версию Функция «Создать свою версию» — это мощный инструмент для обучения и творчества. Она позволяет использовать понравившееся изображение как отправную точку для собственных экспериментов. Как использовать функцию Найдите интересное изображение Просматривайте галерею и найдите работу, которая вас вдохновляет. Откройте просмотр Кликните на изображение для перехода к детальному просмотру. Нажмите «Создать свою версию» Кнопка расположена в панели действий рядом ","section":"gallery"},{"title":"Просмотр галереи","href":"/ru/docs/gallery/gallery-view","content":"Просмотр галереи !Просмотр галереи Галерея ArtGeneration.me демонстрирует изображения, созданные пользователями, в интерактивной сетке, оптимизированной для удобного просмотра на любых устройствах. Слайдер количества изображений В верхней части галереи расположен слайдер для регулировки количества отображаемых изображений. Это позволяет настроить плотность сетки под ваши предпочтения: - Больше изображений — компактный обзор множества работ - Меньше изображений — более крупные превью для детально","section":"gallery"},{"title":"Детали генерации","href":"/ru/docs/gallery/generation-details","content":"Детали генерации !Детали генерации На странице просмотра изображения отображаются все параметры, использованные при генерации. Эта информация позволяет понять, как было создано изображение, и использовать эти знания для собственных работ. Промпт (Prompt) Основной текстовый запрос, который описывает желаемое изображение. Промпт — это «инструкция» для нейросети. Что можно узнать из промпта: - Какие ключевые слова использовал автор - Как структурирован запрос - Какие детали были указаны явно Нажмит","section":"gallery"},{"title":"Просмотр изображения","href":"/ru/docs/gallery/image-view","content":"Просмотр изображения !Просмотр изображения При клике на изображение в галерее открывается полноэкранный режим просмотра. Здесь вы можете детально изучить работу, узнать параметры генерации и взаимодействовать с изображением. Интерфейс просмотра Страница просмотра изображения состоит из нескольких основных областей: Область изображения — центральная часть экрана с изображением в высоком разрешении. Изображение масштабируется для оптимального отображения на вашем экране. Панель информации — справа","section":"gallery"},{"title":"Главная Галерея","href":"/ru/docs/gallery","content":"Главная Галерея !Главная галерея ArtGeneration.me Галерея демонстрирует изображения, созданные пользователями, в интерактивной сетке. Здесь вы можете найти вдохновение, изучить техники других художников и открыть для себя новые стили. Главная обложка галереи Когда вы впервые посетите ArtGeneration.me, главное, что привлечет ваше внимание, — это большое изображение на фоне. Это изображение выбрано сообществом путем голосования: каждый ваш лайк не просто выражение восхищения творчеством, но и ваш ","section":"gallery"},{"title":"Интерактивные элементы","href":"/ru/docs/gallery/interactive-elements","content":"Интерактивные элементы !Интерактивные элементы Галерея содержит множество интерактивных элементов для взаимодействия с контентом. Кнопки действий - Лайк — отметить изображение как понравившееся - Избранное — добавить в коллекцию избранного - Поделиться — отправить ссылку на изображение - Скачать — загрузить изображение на устройство Социальные функции Подписывайтесь на понравившихся авторов, чтобы не пропустить их новые работы. - Подписка на автора — следить за новыми работами пользователя - Ком","section":"gallery"},{"title":"Поиск и категории","href":"/ru/docs/gallery/search-categories","content":"Поиск и категории !Поиск и категории Галерея ArtGeneration.me предоставляет мощные инструменты для поиска и фильтрации изображений. Вы можете легко найти вдохновение, изучить работы других пользователей или найти конкретные стили и техники. Строка поиска В верхней части галереи расположена строка поиска, которая позволяет искать изображения по различным критериям: По ключевым словам — введите описание того, что хотите найти. Поиск работает по промптам, тегам и описаниям изображений. По имени авт","section":"gallery"},{"title":"Похожие изображения","href":"/ru/docs/gallery/similar-images","content":"Похожие изображения !Похожие изображения Под просматриваемым изображением отображается секция с похожими работами. Эта функция помогает находить вдохновение и изучать различные подходы к похожим темам. Как работает подбор похожих изображений Система ArtGeneration.me использует несколько критериев для подбора релевантных работ: Визуальное сходство — алгоритмы анализируют содержимое изображения: цвета, композицию, объекты. Это позволяет находить визуально похожие работы независимо от используемых ","section":"gallery"},{"title":"Элементы просмотра","href":"/ru/docs/gallery/view-elements","content":"Элементы просмотра !Элементы просмотра Страница просмотра изображения содержит множество информативных элементов. Верхняя панель - Название работы — если указано автором - Дата создания — когда было сгенерировано изображение - Кнопка закрытия — возврат к галерее Боковая панель - Аватар автора — фото профиля - Имя автора — ссылка на профиль - Кнопка подписки — подписаться на автора - Статистика — лайки, просмотры, комментарии Нижняя панель - Кнопки действий — лайк, избранное, скачать, поделиться ","section":"gallery"},{"title":"Главная Галерея","href":"/ru/docs/gallery","content":"Главная Галерея Галерея — это раздел, где вы можете просматривать работы других пользователей и находить вдохновение для своих генераций. Просмотр и взаимодействие с изображением При клике на любое изображение в галерее открывается окно просмотра с полной информацией о работе. Информация об изображении В окне просмотра вы увидите: - Промпт — текстовое описание, использованное для генерации - Негативный промпт — что было исключено из генерации - Модель — какая модель использовалась - Стиль — прим","section":"docs"},{"title":"Копировать ссылку","href":"/ru/docs/generator/additional-actions/copy-link","content":"Копировать ссылку !Копировать ссылку Функция копирования ссылки позволяет получить прямой URL на изображение для быстрого обмена. Как использовать Наведите на изображение Найдите нужное изображение в результатах генерации. Нажмите кнопку \"Копировать ссылку\" Кнопка появится на панели действий. Готово Ссылка скопирована в буфер обмена. Возможности ссылки Скопированная ссылка поддерживает автоматический предпросмотр в социальных сетях и мессенджерах. При вставке ссылки получатель сразу увидит превь","section":"additional-actions"},{"title":"Создать похожее","href":"/ru/docs/generator/additional-actions/create-similar","content":"Создать похожее !Создать похожее Функция \"Создать похожее\" генерирует вариации изображения с теми же параметрами, но другим seed. Как работает При нажатии кнопки \"Создать похожее\": Копирование параметров Копируются все параметры исходной генерации. Генерация нового seed Создается новый случайный seed. Запуск генерации Автоматически запускается новая генерация. Результат Вы получите изображение: - С тем же промптом - С той же моделью и стилем - С теми же техническими параметрами - Но с другой слу","section":"additional-actions"},{"title":"Скачать","href":"/ru/docs/generator/additional-actions/download","content":"Скачать !Скачать Функция скачивания позволяет сохранить изображение на ваше устройство в различных форматах. Хранение изображений Все изображения хранятся на сервере в формате WebP без потери качества. При скачивании вы можете выбрать любой формат без ухудшения исходного качества. Доступные форматы При скачивании вы можете выбрать формат: WebP — современный формат с отличным сжатием. Рекомендуется для публикации в интернете. Нативный формат хранения. PNG — высокое качество без потерь. Идеально д","section":"additional-actions"},{"title":"Восстановление лица","href":"/ru/docs/generator/additional-actions/face-restoration","content":"Восстановление лица !Восстановление лица Функция восстановления лица исправляет искажённые лица на сгенерированных изображениях. Назначение Восстановление лица предназначено для значительно повреждённых лиц, а не для незначительных корректировок. Используйте эту функцию, когда лицо сильно искажено. Функция особенно эффективна для: - Результатов модели 1.5 с более низким разрешением - Исправления искажённых черт на средних и дальних планах Проблема AI-генерация иногда создаёт лица с: - Сильными и","section":"additional-actions"},{"title":"Полноэкранный режим","href":"/ru/docs/generator/additional-actions/fullscreen","content":"Полноэкранный режим !Полноэкранный режим Полноэкранный режим позволяет просматривать изображение в максимальном размере с возможностями масштабирования и панорамирования. Как активировать Наведите на изображение Выберите нужное изображение. Нажмите кнопку полноэкранного режима Или дважды кликните на изображение. Готово Изображение откроется на весь экран. Возможности В полноэкранном режиме доступны: - Просмотр в максимальном разрешении - Масштабирование (zoom) — приближение и отдаление - Панорам","section":"additional-actions"},{"title":"Дополнительные действия","href":"/ru/docs/generator/additional-actions","content":"Дополнительные действия После генерации изображения доступен ряд дополнительных действий для улучшения и работы с результатом. Доступные действия При наведении на сгенерированное изображение появляется панель с кнопками действий: - Своё изображение — использовать как основу для новой генерации - Создать похожее — сгенерировать вариацию - Увеличение 2x — улучшить разрешение - Восстановление лица — улучшить качество лиц - Восстановление + Увеличение — одним кликом восстановить лица и увеличить в 2","section":"additional-actions"},{"title":"Расширение границ (Outpainting)","href":"/ru/docs/generator/additional-actions/outpainting","content":"Расширение границ (Outpainting) !Outpainting Outpainting позволяет расширить изображение за его текущие границы, добавляя новый контент в выбранных направлениях. Как работает AI анализирует существующее изображение и генерирует продолжение: - Сохраняет стиль и атмосферу - Продолжает композицию - Добавляет логичные элементы Направления расширения Вы можете расширить изображение в любом направлении: - Дорисовать сверху — добавить контент над изображением - Дорисовать слева — расширить влево - Дори","section":"additional-actions"},{"title":"Своё изображение","href":"/ru/docs/generator/additional-actions/own-image","content":"Своё изображение !Своё изображение Функция \"Своё изображение\" позволяет использовать сгенерированное или загруженное изображение как основу для новой генерации (img2img). Как использовать Наведите на изображение Выберите изображение в результатах генерации. Нажмите кнопку \"Своё изображение\" Изображение будет добавлено в панель настроек. Настройте силу влияния Определите степень влияния исходного изображения. Введите промпт Добавьте новый или измените существующий промпт. Запустите генерацию Нажм","section":"additional-actions"},{"title":"Восстановление + Увеличение","href":"/ru/docs/generator/additional-actions/restoration-upscale","content":"Восстановление + Увеличение !Восстановление + Увеличение Комбинированная функция, объединяющая восстановление лица и увеличение разрешения в одно действие. Преимущества Одним кликом выполняются сразу две операции: 1. Восстановление лиц 2. Увеличение разрешения в 2 раза Это экономит время и упрощает процесс обработки портретных изображений. Как использовать Наведите на изображение Выберите изображение с лицами, которое нужно улучшить. Нажмите кнопку \"Восстановление + Увеличение\" Одним кликом запу","section":"additional-actions"},{"title":"Увеличение 2x (Upscale)","href":"/ru/docs/generator/additional-actions/upscale-2x","content":"Увеличение 2x (Upscale) !Увеличение 2x Функция увеличения удваивает размер изображения с сохранением качества. Как работает Upscale использует специальные AI-алгоритмы для: - Увеличения размера изображения в 2 раза - Добавления деталей - Сохранения чёткости - Устранения артефактов масштабирования Как использовать Наведите на изображение Выберите изображение, которое хотите увеличить. Нажмите кнопку \"Увеличение 2x\" Кнопка появится на панели действий. Дождитесь обработки Результат откроется во всп","section":"additional-actions"},{"title":"Генератор изображений","href":"/ru/docs/generator","content":"Генератор изображений !Генератор изображений ArtGeneration.me Генератор изображений — это основной инструмент ArtGeneration.me, позволяющий создавать уникальные изображения с помощью искусственного интеллекта. Здесь вы можете воплотить любые творческие идеи в визуальную форму. Интерфейс генератора Интерфейс разделён на три основные области: 1. Центральная область — результаты генерации и поле ввода запроса 2. Левая панель — история генераций и быстрые действия 3. Правая панель — настройки модели","section":"generator"},{"title":"Избранное","href":"/ru/docs/generator/left-panel/favorites","content":"Избранное Раздел избранного позволяет сохранять понравившиеся изображения для быстрого доступа. Счётчик избранного Для каждого изображения в левой панели отображается счётчик, показывающий сколько пользователей добавили его в избранное. Добавление в избранное Чтобы добавить изображение в избранное, используйте соответствующую иконку при просмотре изображения. Работа с избранным При работе с изображениями в избранном доступны стандартные действия: - Удаление — удалить изображение. Пока вы не обно","section":"left-panel"},{"title":"Папки","href":"/ru/docs/generator/left-panel/folders","content":"Папки Папки позволяют организовать ваши изображения для удобного доступа. Организация изображений Используйте папки для группировки изображений по проектам, темам или любым другим критериям. Работа с изображениями в папках При работе с изображениями в папках доступны стандартные действия: - Удаление — удалить изображение. Пока вы не обновили страницу (в течение часа), у вас есть возможность восстановить. - Предпросмотр — наведите курсор на иконку лупы для быстрого просмотра с информацией о дате ","section":"left-panel"},{"title":"История генераций","href":"/ru/docs/generator/left-panel/history","content":"История генераций История генераций — это раздел, где отображаются все созданные вами изображения. Отображение изображений Все ваши изображения отображаются в хронологическом порядке — от новых к старым. Поиск Используйте функцию поиска для нахождения изображений по тексту промпта. Просто введите ключевые слова, и система покажет соответствующие генерации. Мобильная версия На мобильных устройствах и экранах с небольшим разрешением раздел истории скрыт по умолчанию. Нажмите на панель, чтобы разве","section":"left-panel"},{"title":"Левая панель","href":"/ru/docs/generator/left-panel","content":"Левая панель Левая панель генератора отображает все ваши созданные изображения и предоставляет инструменты для работы с ними. Основные возможности Хронологический порядок — все созданные вами изображения отображаются в хронологическом порядке. Поиск по промпту — функция поиска позволяет находить изображения по тексту промпта. Счётчики лайков и избранного — для каждого изображения отображается количество лайков и добавлений в избранное. Кнопка сброса (зелёная) В верхней части левой панели находит","section":"left-panel"},{"title":"Быстрые действия","href":"/ru/docs/generator/left-panel/quick-actions","content":"Быстрые действия !Быстрые действия Быстрые действия — это набор часто используемых функций, доступных одним кликом. Они ускоряют рабочий процесс и позволяют выполнять типичные операции без навигации по меню. Расположение Панель быстрых действий расположена в нижней части левой панели генератора. Она всегда видна и доступна независимо от выбранной вкладки (История, Избранное, Папки). Основные действия Генерировать — запускает генерацию с текущими параметрами. Это основная кнопка для создания изоб","section":"left-panel"},{"title":"Язык запросов","href":"/ru/docs/generator/query-language","content":"Язык запросов Текстовый запрос (промпт) — это основной способ описать желаемое изображение для AI. От качества запроса напрямую зависит результат генерации. Рекомендуемая структура промпта Для достижения лучших результатов рекомендуется следовать этой структуре: Тип изображения Фотография, иллюстрация, 3D-рендер, картина. Основной объект Что изображено: человек, животное, пейзаж, предмет. Внешний вид Детали объекта: цвет, размер, материал, текстура. Элементы сцены Дополнительные объекты и детали","section":"generator"},{"title":"Советы по запросам","href":"/ru/docs/generator/query-tips","content":"Советы по запросам Практические рекомендации для создания эффективных промптов. Следуйте структуре Рекомендуемая структура промпта для лучших результатов: Тип изображения Фотография, рисунок, 3D, иллюстрация Объект Что или кто на изображении Внешний вид Детали и характеристики объекта Элементы Дополнительные объекты и детали Локация Где находится объект Эффекты Освещение, атмосфера, настроение Стиль Художественное направление Будьте конкретны Чем детальнее описание, тем точнее результат: Использ","section":"generator"},{"title":"Замена лица (Face Swap)","href":"/ru/docs/generator/right-panel/face-swap","content":"Замена лица (Face Swap) !Замена лица ArtGeneration.me предлагает функцию замены лица на изображениях. Этот инструмент позволяет заменить лицо на любой генерации или загруженном изображении на другое лицо по вашему выбору. Замену лица можно активировать в нескольких ситуациях. При создании новой генерации В правой боковой панели найдите раздел «Замена лица», загрузите фотографию с лицом, которое хотите использовать. После генерации изображения система автоматически применит замену, результат гене","section":"right-panel"},{"title":"Правая панель","href":"/ru/docs/generator/right-panel","content":"Правая панель Правая панель генератора — это центр управления всеми параметрами генерации изображений в ArtGeneration.me. Здесь вы выбираете модель, стиль, настраиваете технические параметры и используете дополнительные функции. Структура панели Правая панель организована в логические секции, каждая из которых отвечает за определённый аспект генерации: Выбор модели и стиля — основа любой генерации. Модель определяет «характер» изображения, а стиль добавляет художественное направление. Поле промп","section":"right-panel"},{"title":"Своё изображение (img2img)","href":"/ru/docs/generator/right-panel/init-image","content":"Своё изображение (img2img) !Своё изображение «Своё изображение» позволяет вам использовать любое изображение в качестве основы для генерации. Вы можете загрузить готовое изображение, нарисовать эскиз или использовать маску для частичной перегенерации. !Пример редактирования — надеть шляпу на кота Все генерации из «Своего изображения» по умолчанию получают «Приватный режим», чтобы вы случайно не выложили то, что не хотели бы. Способы добавления изображения Загрузка изображения Загрузите готовое и","section":"right-panel"},{"title":"LoRA","href":"/ru/docs/generator/right-panel/loras","content":"LoRA !LoRA LoRA (Low-Rank Adaptation) — это дополнительные мини-модели, которые добавляют новую информацию к генерации. Каждая LoRA обучена на одном конкретном концепте, что позволяет точно воспроизводить определённые стили, персонажей или эффекты. Что такое LoRA LoRA — это небольшие дообученные модели, которые добавляют к базовой модели новые знания. В ArtGeneration.me доступны следующие категории LoRA: - Жесты и позы — специфические позы, жесты рук, ракурсы - Персонажи — конкретные персонажи и","section":"right-panel"},{"title":"Модели","href":"/ru/docs/generator/right-panel/models","content":"Модели !Выбор модели Модель — это что-то вроде операционной системы. Если сам ArtGeneration.me — это компьютер, системный блок, то модель — это его операционная система. Всё, что вы сможете сгенерировать, зависит от модели. Базовые архитектуры На платформе используются две основные архитектуры: - SDXL — высококачественная архитектура для создания детализированных изображений - FLUX — новейшая архитектура с глубоким пониманием промптов и улучшенным следованием инструкциям На основе этих базовых а","section":"right-panel"},{"title":"Негативный промпт","href":"/ru/docs/generator/right-panel/negative-prompt","content":"Негативный промпт !Негативный промпт Негативный промпт — это инструмент, который позволяет указать нейросети, чего следует избегать при генерации изображения. Он вводится в поле «Избегать» на панели настроек. Как работает негативный промпт Когда вы указываете что-то в поле «Избегать», модель старается «отодвинуться» от этих концепций в процессе генерации. Это не гарантия, что элемент не появится, но значительно снижает вероятность. Негативный промпт особенно полезен для: - Устранения типичных ар","section":"right-panel"},{"title":"Параметры генерации","href":"/ru/docs/generator/right-panel/parameters","content":"Параметры генерации !Параметры генерации Технические параметры позволяют тонко настроить процесс генерации изображений. Понимание этих параметров поможет вам получать более качественные и предсказуемые результаты. Шум (Seed) !Шум Шум (Seed) — это начальное значение для генератора случайных чисел. Это число определяет «случайность» генерации. Как работает: - При одинаковом значении шума и всех остальных параметрах вы получите идентичное изображение - Случайный шум даёт уникальный результат каждый","section":"right-panel"},{"title":"Режим производительности","href":"/ru/docs/generator/right-panel/performance-mode","content":"Режим производительности !Режим производительности Режим производительности (креативность) — это удобный способ быстро настроить баланс между скоростью генерации и качеством результата. Вместо ручной настройки множества параметров вы можете выбрать один из предустановленных режимов. Доступные режимы Набросок (Sketch) Самый быстрый режим для тестирования идей. Характеристики: - Минимальное количество шагов генерации - Самое быстрое время выполнения - Базовое качество изображения - Минимальный рас","section":"right-panel"},{"title":"Разрешение","href":"/ru/docs/generator/right-panel/resolution","content":"Разрешение !Разрешение Разрешение определяет размер генерируемого изображения в пикселях. Правильный выбор разрешения важен для получения качественного результата. Как выбрать разрешение В ArtGeneration.me доступен удобный ползунок для выбора разрешения. Вы можете: - Выбрать из предустановленных соотношений сторон (1:1, 3:4, 4:3, 16:9, 9:16) - Вручную задать ширину и высоту с помощью ползунков - Увидеть текущее соотношение сторон и размер в пикселях Соотношения сторон Квадратное (1:1) Идеально д","section":"right-panel"},{"title":"Стили","href":"/ru/docs/generator/right-panel/styles","content":"Стили !Стили В ArtGeneration.me представлена обширная коллекция из 307 уникальных стилей, собранных со всего мира. Каждый стиль имеет свои особенности и может кардинально изменить результат генерации. Стили — это предустановленные запросы, которые добавляются к тому, что вы вводите в основное поле ввода. Стили — это удобный и быстрый способ попробовать разные концепции. !Выбор стилей Один и тот же запрос будет работать совершенно иначе с разными стилями. Категории стилей Стили сгруппированы по к","section":"right-panel"},{"title":"Генератор изображений","href":"/ru/docs/generator","content":"Генератор изображений Генератор — это основной инструмент платформы для создания изображений с помощью искусственного интеллекта. Здесь вы можете превратить текстовое описание в уникальное изображение. Основное поле ввода (Промпт) Промпт — это текстовое описание желаемого изображения. Чем подробнее и точнее описание, тем лучше результат. Пишите промпты на английском языке для лучших результатов. Большинство моделей обучены на англоязычных данных. Веса в промптах Система поддерживает специальный ","section":"docs"},{"title":"Руководство пользователя","href":"/ru/docs","content":"Руководство пользователя ArtGeneration.me Добро пожаловать в руководство пользователя ArtGeneration.me — платформы для создания изображений с помощью искусственного интеллекта. О платформе ArtGeneration.me предоставляет доступ к передовым моделям генерации изображений. Вы можете создавать уникальные изображения, используя текстовые описания (промпты), выбирать различные стили и модели, а также применять продвинутые функции редактирования. Начало работы 1. Зарегистрируйтесь на платформе через соц","section":"docs"},{"title":"Счётчик генераций","href":"/ru/docs/main-page/generation-counter","content":"Счётчик генераций !Счётчик генераций Счётчик генераций отображает количество доступных генераций и помогает отслеживать ваш баланс. Счётчик всегда виден в верхней части экрана, что позволяет быстро проверить остаток генераций. Расположение Счётчик находится в верхней части интерфейса и всегда доступен для просмотра. Информация в счётчике - Текущий баланс — количество доступных генераций - Тип генераций — ежедневные или несгораемые - Статус подписки — активна ли PRO подписка Цветовая кодировка Сч","section":"main-page"},{"title":"Получение генераций","href":"/ru/docs/main-page/getting-generations","content":"Получение генераций !Получение генераций Генерации — это основная валюта на платформе ArtGeneration.me. Каждая генерация позволяет создать одно изображение с помощью искусственного интеллекта. Способы получения генераций Бесплатные генерации - Ежедневные генерации — каждый день вы получаете определённое количество бесплатных генераций - Приветственный бонус — новые пользователи получают 100 несгораемых генераций и 3 дня PRO подписки при регистрации Приветственный бонус включает 100 несгораемых г","section":"main-page"},{"title":"Главная страница ArtGeneration.me","href":"/ru/docs/main-page","content":"Главная страница ArtGeneration.me Навигационная панель В самом верху экрана вы увидите навигационную панель, где бы вы ни были. В любой момент можете перейти на главную кликнув на логотип ArtGeneration.me. Навигационное меню содержит три основных раздела: - Исследуй — Это основной раздел, из которого можно перейти в любые другие. Тут и основная галерея с поиском и категориями, и галерея изображений. - Создавай — В разделе \"Создавай\" вы сможете сгенерировать своё изображение, об этом мы подробнее","section":"main-page"},{"title":"Навигация","href":"/ru/docs/main-page/navigation","content":"Навигация !Навигация Навигационное меню расположено в верхней части страницы и обеспечивает быстрый доступ ко всем основным разделам сайта. Клик на логотип ArtGeneration.me из любого места сайта вернёт вас на главную страницу. Элементы навигации - Логотип — возврат на главную страницу - Галерея — просмотр работ сообщества - Создать — переход к генератору изображений - Редактор — инструменты редактирования изображений - О сервисе — информация о платформе - Руководство — документация и справка Мен","section":"main-page"},{"title":"Окно оплаты","href":"/ru/docs/main-page/payment-window","content":"Окно оплаты Окно оплаты позволяет приобрести доступ к PRO-функциям или дополнительные генерации. Доступ к окну оплаты Окно оплаты можно открыть несколькими способами: Через кнопку в шапке Нажмите на кнопку «Забрать 600» в верхней части сайта. Через счётчик монет Кликните на счётчик монет в правом верхнем углу. Через меню пользователя Перейдите в раздел «Платежи» в выпадающем меню пользователя. Вкладки окна оплаты Окно оплаты содержит три вкладки: 1. Единоразовая оплата Доступ к PRO без автоматич","section":"main-page"},{"title":"Главная страница ArtGeneration.me","href":"/ru/docs/main-page","content":"Главная страница ArtGeneration.me После регистрации вы попадаете на главную страницу платформы. Здесь собраны все основные инструменты и разделы для работы с генерацией изображений. Навигационная панель В самом верху экрана вы увидите навигационную панель, где бы вы ни были. В любой момент можете перейти на главную кликнув на логотип ArtGeneration.me. Основные разделы навигации: - Исследуй — Это основной раздел, из которого можно перейти в любые другие. Тут и основная галерея с поиском и категор","section":"docs"},{"title":"Приветствие и регистрация","href":"/ru/docs/registration","content":"Приветствие и регистрация Добро пожаловать в удивительный мир цифрового творчества на ArtGeneration.me, где каждый может стать художником с помощью искусственного интеллекта. Чтобы начать своё путешествие, вам необходимо создать личный аккаунт. Это позволит вам полностью погрузиться в процесс творчества и использовать все инструменты платформы. На главной странице вы найдёте кнопку \"Начать творить\" – ваш первый шаг к созданию уникальных изображений. При просмотре любого изображения в галерее вы ","section":"registration"},{"title":"Процесс регистрации","href":"/ru/docs/registration/process","content":"Процесс регистрации !Процесс регистрации Регистрация на ArtGeneration.me — быстрый и простой процесс, который займёт менее минуты. Платформа предлагает несколько способов создания аккаунта на ваш выбор. Способы регистрации Быстрая авторизация через VK Самый быстрый способ для пользователей ВКонтакте: 1. Нажмите кнопку «Войти через VK» 2. Подтвердите доступ в окне ВКонтакте 3. Готово — аккаунт создан автоматически Преимущества: - Не нужно придумывать новый пароль - Автоматическое заполнение профи","section":"registration"},{"title":"Приветственный бонус","href":"/ru/docs/registration/welcome-bonus","content":"Приветственный бонус !Приветственный бонус Каждый новый пользователь ArtGeneration.me получает щедрый приветственный бонус, который позволяет сразу попробовать все возможности платформы без ограничений. Что входит в бонус 3 дня PRO-подписки Полный доступ ко всем премиум-функциям платформы на 3 дня: Увеличенные лимиты: - 300 генераций в день вместо стандартных 50 - Возможность генерировать изображения в высоком разрешении - Приоритетная очередь — ваши генерации обрабатываются быстрее Расширенный ","section":"registration"},{"title":"Зачем регистрироваться?","href":"/ru/docs/registration/why-register","content":"Зачем регистрироваться? !Зачем регистрироваться Регистрация на ArtGeneration.me открывает доступ к полному функционалу платформы и множеству преимуществ, недоступных гостевым пользователям. Сохранение работ История генераций: - Все ваши генерации автоматически сохраняются в облаке - Доступ к истории с любого устройства - Возможность вернуться к любой работе и создать новую версию - Просмотр параметров генерации для повторения результата Организация коллекции: - Добавляйте лучшие работы в избранн","section":"registration"},{"title":"Приветствие и регистрация","href":"/ru/docs/registration","content":"Приветствие и регистрация Добро пожаловать в удивительный мир цифрового творчества на ArtGeneration.me, где каждый может стать художником с помощью искусственного интеллекта. Чтобы начать своё путешествие, вам необходимо создать личный аккаунт. Это позволит вам полностью погрузиться в процесс творчества и использовать все инструменты платформы. На главной странице вы найдёте кнопку \"Начать творить\" – ваш первый шаг к созданию уникальных изображений. При просмотре любого изображения в галерее вы ","section":"docs"},{"title":"Правила сервиса","href":"/ru/docs/rules","content":"Правила сервиса 1. Сервис предназначен для лиц старше 18 лет. Регистрируясь, вы подтверждаете свое совершеннолетие. 2. Запрещено использовать сервис для создания изображений, нарушающих законодательство РФ: содержащих порнографию, сцены насилия, пропаганду экстремизма, разжигание межнациональной розни и т.д. Модераторы будут удалять такой контент без предупреждения. Создание противозаконного контента приводит к немедленному удалению изображений и возможной блокировке аккаунта. 3. В разделе NSFW ","section":"docs"},{"title":"Меню пользователя","href":"/ru/docs/user-menu","content":"Меню пользователя !Меню пользователя Меню пользователя — центр управления вашим аккаунтом на ArtGeneration.me. Здесь собраны все настройки, информация о балансе, подписках и инструменты для работы с вашими изображениями. Как открыть меню Меню пользователя доступно из любой страницы сайта: Найдите иконку профиля Иконка профиля находится в правом верхнем углу шапки сайта. Откройте меню Нажмите на иконку для открытия выпадающего меню. Выберите раздел Выберите нужный раздел из списка. Если вы не авт","section":"user-menu"},{"title":"Меню пользователя","href":"/ru/docs/user-menu","content":"Меню пользователя Меню пользователя предоставляет доступ к настройкам аккаунта и персональным функциям. Чтобы открыть меню, кликните на иконку профиля в правом верхнем углу экрана. Личное Раздел \"Личное\" — это ваш персональный кабинет на платформе. Мои работы Здесь хранятся все ваши сгенерированные изображения. Вы можете: - Просматривать историю генераций - Организовывать изображения по папкам - Удалять ненужные работы - Делать изображения публичными или приватными Папки Создавайте папки для орг","section":"docs"},{"title":"Как редактировать документацию","href":"/ru/about-docs/contributing","content":"Как редактировать документацию Любой пользователь может помочь улучшить документацию ArtGeneration.me! Это проще, чем кажется. Здесь вы найдете пошаговую инструкцию для новичков. Зачем это нужно? - Вы заметили ошибку или опечатку - Описание устарело после обновления сервиса - Хотите добавить полезную информацию - Можете лучше объяснить какую-то функцию Ваш вклад поможет тысячам других пользователей! Способ 1: Редактирование через браузер (самый простой) Этот способ не требует установки программ.","section":"about-docs"},{"title":"Авторы документации","href":"/ru/about-docs/contributors","content":"Авторы документации Эта документация создается и поддерживается сообществом пользователей ArtGeneration.me. Мы благодарим всех, кто помогает улучшать материалы! Как попасть в список авторов Если вы внесли вклад в документацию (исправили ошибку, добавили новый раздел, улучшили описание), вы можете добавить себя в список авторов. Просто отредактируйте эту страницу и добавьте свою информацию по шаблону ниже. Наши авторы {/ Добавьте себя по шаблону: - Ваше имя или никнейм — краткое описание вклада -","section":"about-docs"},{"title":"Новости и обновления","href":"/ru/news","content":"Новости и обновления Следите за развитием платформы ArtGeneration.me. Здесь собраны все обновления сервиса. --- Масштабное обновление моделей Дата: 15 января 2026 !Новые модели — Midjourney V7, Ideogram 3.0, DALL·E 3 и другие Крупнейшее пополнение библиотеки моделей в истории платформы! Добавлено более 25 новых моделей от ведущих провайдеров. Новые модели Midjourney: - Midjourney V7 (NEW!) - Midjourney V6.1 - Midjourney V6 Ideogram: - Ideogram 3.0 (NEW!) - И ещё 9 моделей семейства Ideogram GPT ","section":"news"}]